// ВЕЩИ-В-МАССИВЫ---------------------------------------------------
// Вещи в мире записывать в массивы, и создать по этим массивам вещей справочник
// У нас будет несколько массивов - еда, техника, одежда, инструменты.
// -----------------------------------------------------------------

// НАЗВАНИЯ-ФУНКЦИЙ-------------------------------------------------
// Функция которая возвращает Boolean начинается c is. exp - isDone
// Обработчик именно на UI может начинаться с handle. exp - handleCreateChip  

// РАСЧЕТ-ПРОЦЕНТОВ------------------------------------------------
// Пока что от 1 до 100, возможно потом сделать от 1.0 до 99.9

// РАСЧЕТ-ПРОКАЧКИ-НАВЫКА-------------------------------------------
// Навык качается и при успешном применении и при неуспешном тоже, но меньше
// И будет перк "Учусь на ошибках" опыта столько же, сколько при успешном

// конечные значения = контекст + пулл эффектов + х-ки персонажа

// константы enum-like GOOD_EVENT_ID = 1; BAD_EVENT_ID = 2 в функцию с экстраШансом плюс 
// строгая типизация возращаемых значений 

// amount.padStart(10)

// ESLinter покапать инфу

// Ввести лог действий - результатов.
